//---------------------------------------------------------------------------

#include <vcl.h>
#pragma hdrstop

#include "Unit1.h"
//---------------------------------------------------------------------------
#pragma package(smart_init)
#pragma resource "*.dfm"
TInfo *Info;
//---------------------------------------------------------------------------
__fastcall TInfo::TInfo(TComponent* Owner)
	: TForm(Owner)
{
}
//---------------------------------------------------------------------------
void __fastcall TInfo::TreeView1Change(TObject *Sender, TTreeNode *Node)
{
	Memo1->Lines->Clear();
	switch(TreeView1->Selected->AbsoluteIndex) {
		case 0: {Memo1->Lines->Add("Travel Helper. Програма розроблена як органайзер ваших подорожей. У ній Ви можете керувати подорожами з легкістю та задоволенням. Це тестова версія програми. Сповіщення про оновлення та покращення будуть надіслані Вам на e-mail."); break;}
		case 2: {Memo1->Lines->Add("Для того, щоб зчитати дані з файлу потрібно відкрити меню Файл та вибрати пункт Відкрити. У новому діалоговому вікні вибрати потрібний непорожній файл та натиснути кнопку \"Відкрити\".Дані повинні бути у форматі: \"Країна Місто дд.мм.рррр. Тривалість Бюджет(ціле число) Ціль Статус\""); break;}
		case 3: {Memo1->Lines->Add("Для того, щоб записати дані у файл потрібно відкрити меню Файл та вибрати пункт Зберегти."); break;}
		case 5: {Memo1->Lines->Add("Для того, щоб додати новий елемент потрібно відкрити меню Редагування та вибрати пункт Додати. У вікні, яке з'явилося, потрібно заповнити всі поля та натимнути кнопку Додати."); break;}
		case 6: {Memo1->Lines->Add("Для того, щоб видалити елемент зі списку потрібно відкрити меню Редагування та вибрати пункт Видалити. У вікні, яке з'явилося, вибрати позицію елемента та натиснути кнопку Видалити."); break;}
		case 7: {Memo1->Lines->Add("Для того, щоб очистити весь список, потрібно відкрити меню Редагування та вибрати пункт Видалити усі."); break;}
		case 8: {Memo1->Lines->Add("Для того, щоб надрукувати всі подорожі, потрібно вибрати пункт меню Надрукувати."); break;}
		case 10:{Memo1->Lines->Add("Для того, щоб посортувати список за певним критерієм, потрібно скористатися кнопками, що знаходять одразу ж над таблицею. Кнопка зі стрілкою вверх посортує список у порядку зростання, кнопка зі стрілкою вниз - у порядку спадання. Кожна пара кнопок відповідає за ту категорію, над якою безпосередньо вона і розміщена."); break;}
		case 12:{Memo1->Lines->Add("Для того, щоб вивести усі елементи за останній місяць, потрібно відкрити меню Вибірково та вибрати пункт За останній місяць."); break;}
		case 13:{Memo1->Lines->Add("Для того, щоб вивести елементи з найбільшою тривалістю, потрібно відкрити меню Вибірково та вибрати пункт Максимальна тривалість у кожній групі."); break;}
		case 14:{Memo1->Lines->Add("Для того, щоб вивести усі елементи зі статусом \"Заплановано\" та їх відсоток, потрібно відкрити меню Вибірково та вибрати пункт Заплановано, %."); break;}
		case 15:{Memo1->Lines->Add("Для того, щоб вивести топ 5 найдорожчих подорожей, потрібно відкрити меню Вибірково та вибрати пункт Топ 5 найдорожчих подорожей."); break;}
		case 16:{Memo1->Lines->Add("Для того, щоб вивести середню тривалість подорожей, потрібно відкрити меню Вибірково та вибрати пункт Середня тривалість."); break;}
	}
}
//---------------------------------------------------------------------------
